#!/usr/bin/env python
# encoding: utf-8
'''

@Author : bodong
@contact: bod@glsc.com.cn
@File : constant.py 
@Time : 2021/4/23 13:37
@desc:  
'''

industry = {
    "CI005001.WI": "石油石化", "CI005002.WI": "煤炭", "CI005003.WI": "有色金属",
    "CI005004.WI": "电力及公用事业", "CI005005.WI": "钢铁", "CI005006.WI": "基础化工",
    "CI005007.WI": "建筑", "CI005008.WI": "建材", "CI005009.WI": "轻工制造",
    "CI005010.WI": "机械", "CI005011.WI": "电力设备及新能源", "CI005012.WI": "国防军工",
    "CI005013.WI": "汽车", "CI005014.WI": "商贸零售", "CI005015.WI": "消费者服务",
    "CI005016.WI": "家电", "CI005017.WI": "纺织服装", "CI005018.WI": "医药",
    "CI005019.WI": "食品饮料", "CI005020.WI": "农林牧渔", "CI005021.WI": "银行",
    "CI005022.WI": "非银行金融", "CI005023.WI": "房地产", "CI005024.WI": "交通运输",
    "CI005025.WI": "电子", "CI005026.WI": "通信", "CI005027.WI": "计算机",
    "CI005028.WI": "传媒", "CI005029.WI": "综合", "CI005030.WI": "综合金融",
    "CIHK5015.WI": "餐饮旅游", "CIHK5028.WI": "传媒", "CIHK5004.WI": "电力及公用事业",
    "CIHK5011.WI": "电力设备", "CIHK5025.WI": "电子元器件", "CIHK5023.WI": "房地产",
    "CIHK5017.WI": "纺织服装", "CIHK5022.WI": "非银行金融", "CIHK5005.WI": "钢铁",
    "CIHK5012.WI": "国防军工", "CIHK5010.WI": "机械", "CIHK5006.WI": "基础化工",
    "CIHK5027.WI": "计算机", "CIHK5016.WI": "家电", "CIHK5008.WI": "建材",
    "CIHK5007.WI": "建筑", "CIHK5024.WI": "交通运输", "CIHK5002.WI": "煤炭",
    "CIHK5020.WI": "农林牧渔", "CIHK5013.WI": "汽车", "CIHK5009.WI": "轻工制造",
    "CIHK5014.WI": "商贸零售", "CIHK5001.WI": "石油石化", "CIHK5019.WI": "食品饮料",
    "CIHK5026.WI": "通信", "CIHK5018.WI": "医药", "CIHK5021.WI": "银行",
    "CIHK5003.WI": "有色金属", "CIHK5029.WI": "综合"
}
